//
//  Data.swift
//  7021final
//
//  Created by User16 on 2020/6/24.
//  Copyright © 2020 ntou. All rights reserved.
//

import Foundation

let leaders = [leader(name: "Duncan", country: "美國", intro:"蒂莫西·西奧多·鄧肯（英語：Timothy Theodore Duncan，1976年4月25日－），一般稱為提姆·鄧肯（Tim Duncan），生於美屬維京群島首府克里斯琴斯特德，前職業籃球運動員，場上位置為大前鋒/中鋒，隸屬NBA聖安東尼奧馬刺。鄧肯在中學之前是一位游泳選手，在高中成為一名籃球選手，在維克弗斯特大學加入籃球校隊，獲得了大西洋沿岸聯盟最佳運動員、奈史密斯學院年度最佳球員、約翰壺特大獎。畢業後，鄧肯以狀元身份加入馬刺隊。他曾獲得2次最有價值球員，並且五度帶領馬刺隊在1999年、2003年、2005年、2007年和2014年獲得NBA總冠軍，更年年進入季後賽，亦三度成為NBA總決賽最有價值球員。此外，鄧肯還十五度入選NBA全明星賽、十五度入選NBA最佳陣容、十五度入選NBA最佳防守陣容，被公認是史上最偉大球員之一。2016年7月11日正式宣布退休，結束了長達19年的NBA球員生涯，職業球員生涯都在聖安東尼奧馬刺隊渡過。在球場外建立了「提姆·鄧肯基金會」，為美國的健康醫療、教育和青年體育事業做貢獻。"),
               leader(name: "parker", country: "法國", intro:"小威廉·安東尼·帕克（英語：William Anthony Parker Jr.，1982年5月17日－），通稱東尼·帕克（Tony Parker），綽號TP、法國小跑車，是一位已退休的法國職業籃球運動員，在2001年NBA選秀大會中於首輪第二十八順位被聖安東尼奧馬刺選中。現為ASVEL Basket老闆。身為一名職業籃球運動員的兒子，帕克在法國籃球聯盟的巴黎競技效力了兩年之後赴美參加了選秀，並且很快就成為馬刺的先發控球後衛，幫助馬刺奪得四次NBA總冠軍（2003年、2005年、2007年、2014年）。帕克擁有出色的切入和中距離投籃能力，同時具備優異的傳球視野與控球能力,切入籃下的速度極快故有「法國小跑車」的稱號。他的球風偏重於切入突破得分或中距離跳投，其藉由提姆·鄧肯的擋拆反手上籃為著名招式。職業生涯六次入選NBA全明星賽，三次入選NBA年度第二隊、一次入選NBA年度第三隊，並在2006–07賽季榮膺NBA總決賽最有價值球員，成為首位獲得此獎項的外籍球員。"),
               leader(name: "manu", country: "阿根廷", intro:"埃曼努爾·大衛·「馬紐」·吉諾比利·馬卡里（西班牙語：Emanuel David Manu Ginóbili Maccari，1977年7月28日－），已退休阿根廷職業籃球運動員，其NBA生涯效力於聖安東尼奧馬刺隊，綽號「鬼之切入」、「妖刀」、「阿根廷刺客」，球衣號碼為20號，場上位置為得分後衛。他身高1米98，體重93公斤。左手球員，善於蛇形突破和遠射，並有獨門絕技歐洲步，連火箭隊的詹姆士·哈登都承認自己打球的風格樣版正是吉諾比利，巔峰期間的吉諾比利就是無解般的存在，能利用切入撕裂對方的禁區防守。2005年總冠軍系列戰，即使是銅牆鐵壁的底特律活塞也擋不住。然而，這樣一張的王牌級球員，卻甘心在馬刺扮演最佳第六人，與提姆·鄧肯和東尼·帕克組成「GDP三巨頭」，幫助馬刺隊於2003、2005、2007、2014年獲得NBA總冠軍。"),
               leader(name: "david", country: "美國", intro:"大衛·莫里斯·羅賓森（英語：David Maurice Robinson，1965年8月6日－），出生於美國佛羅里達州的基衛斯特特，為前美國職業籃球運動員，場上位置為中鋒，身高216公分。羅賓森在1987年NBA選秀大會中被聖安東尼奧馬刺以首輪第一順位選中，因為堅持先於美國海軍服役，故球迷暱稱其為「海軍上將」（The Admiral）。在進入聖安東尼奧馬刺後，羅賓森立即成為隊上重要的即戰力，十四年職業生涯全部奉獻給馬刺，被普遍認為是聯盟歷史最偉大的長人球員之一。在他職業生涯中馬刺唯一最慘的球季是他因背傷而缺陣的情形。他最知名的便是與馬刺另一位傳奇大前鋒，也是後輩的提姆·鄧肯亦師亦友的情誼，在生涯末期羅賓森自願退居二線全力輔佐鄧肯，也造就了聯盟最為知名的雙塔傳奇。羅賓森曾十次入選全明星陣容，新秀賽季獲選年度最佳新秀；1999年與2003年幫助馬刺奪得總冠軍。1995年榮獲年度最有價值球員；四次入選年度第一隊；四次入選最佳防守陣容第一隊；獲得一次得分王、一次阻攻王和一次籃板王。此外他也是兩屆奧運會金牌得主（1992年、1996年）。2009年9月11日，羅賓森和麥可·喬丹、約翰·史塔克頓、傑瑞·史隆、C·薇薇安·史金格一同入選奈史密斯籃球名人紀念堂。"),
               leader(name: "marco", country: "義大利", intro:"作為一個義大利出生的小男孩，Marco Belinelli是特別的。因為當其他的小孩在踢足球的時候，他在打籃球，作為一個歐洲人，小時候的Marco，無疑是個異類。只不過，長大後的Marco非旦沒有收斂，更成為異類中的異類，因為他不僅打籃球，他還打到全世界最高殿堂，NBA。而一個來自熱愛足球的義大利，要達到這樣的成就，絕對不是一件易事。馬科·貝里內利於2007年通過選秀進入NBA，先後效力於勇士、猛龍、新奧爾良黃蜂、公牛、馬刺、國王、夏洛特黃蜂、老鷹和76人等球隊，2014年NBA全明星週末奪得三分球大賽冠軍，2013-14賽季隨馬刺隊奪得NBA總冠軍。"),
               leader(name: "LA", country: "美國", intro:"拉瑪庫斯·諾萊·艾德里奇（英語：LaMarcus Nurae Aldridge，1985年7月19日－），出生於德克薩斯州達拉斯，美國職業籃球運動員，暱稱『Agg』、『LMA』。目前效力於NBA聯盟的聖安東尼奧馬刺，場上位置為大前鋒或中鋒。大學時曾就讀於德克薩斯大學奧斯汀分校。在2006年NBA選秀中，於首輪第二順位被芝加哥公牛選中，隨後交易至波特蘭拓荒者。目前被普遍認為是現役最優秀的大前鋒之一。經交易而來到拓荒者後，艾德里奇曾與布蘭頓·羅伊以及格雷格·歐登組成擁有衝擊總冠軍實力的鐵三角陣容。然而事與願違，在羅伊和歐登因傷病困擾而相繼離開拓荒者後，艾德里奇仍獨自背負拓荒者領袖的責任，並逐漸打出全明星的身手。期間他四次入選全明星陣容，並首次入選NBA年度第二隊，二次入選NBA年度第三隊。在波特蘭拓荒者效力了九個賽季後，艾德里奇在2015年7月選擇以自由球員身份加盟聖安東尼奧馬刺。雖然最初因戰術設計上適應不良而表現不佳，但在2017–18賽季成功帶領馬刺延續季後賽紀錄。即使馬刺於季後賽首輪被金州勇士4−1淘汰，但其獨撐大樑的拚戰精神令人動容。"),
               leader(name: "demar", country: "美國", intro:"德瑪爾·達內爾·德羅展（英語：DeMar Darnell DeRozan，1989年8月7日－），出生於加利福尼亞州康普頓，綽號DDR、龍王，為現役美國NBA聯盟的職業籃球運動員。目前效力於聖安東尼奧馬刺，主要位置為得分後衛，以中距離和切入聞名。德羅展在高中嶄露了優異的籃球天賦，曾連續兩年率領校隊奪得摩爾聯賽冠軍，並獲選參加麥當勞高中全明星賽。畢業後進入南加州大學就讀了一年，之後在2009年NBA選秀大會中被多倫多暴龍以首輪第九順位選中，並迅速證明自身的實力與價值，成為自文斯·卡特和克里斯·波許離隊後的新一代暴龍指標球星。2017–18賽季結束後與聖安東尼奧馬刺的科懷·雷納德互換球隊。德羅展擁有出色的單打能力，近年來順應聯盟發展趨勢也逐漸開發出外線能力。生涯目前共四次入選NBA全明星賽，並於2016–17賽季入選NBA年度第三隊。2014年，德羅展代表美國國家男子籃球隊參加2014年世界盃籃球賽。2016年，德羅展再度代表美國隊參加2016年夏季奧林匹克運動會，並獲得了金牌。"),
               


]

